type=page
status=published
title=delete-instance
next=delete-jacc-provider.html
prev=delete-iiop-listener.html
~~~~~~

= delete-instance

[[delete-instance-1]][[GSRFM00085]][[delete-instance]]

== delete-instance

Deletes a {productName} instance

[[sthref753]]

=== Synopsis

[source]
----
asadmin [asadmin-options] delete-instance [--help]
instance-name
----

[[sthref754]]

=== Description

The `delete-instance` subcommand deletes a {productName} instance.
This subcommand requires the Distributed Component Object Model (DCOM)
remote protocol or secure shell (SSH) to be configured on the host where
the domain administration server (DAS) is running and on the host that
is represented by the node where the instance resides.

[NOTE]
====
DCOM or SSH is not required if the instance resides on a node of type
`CONFIG` that represents the local host. A node of type `CONFIG` is not
enabled for remote communication over DCOM or SSH.
====

You may run this subcommand from any host that can contact the DAS.

The subcommand can delete any {productName} instance, regardless of
how the instance was created. For example, this subcommand can delete an
instance that was created by using the
link:create-local-instance.html#create-local-instance-1[`create-local-instance`(1)]
subcommand.

The instance that is being deleted must not be running. Otherwise, an
error occurs.

The subcommand deletes an instance by performing the following actions:

* Removing the instance from the configuration of the domain
  administration server (DAS)
* Deleting the instance's files from file system

If the instance that is being deleted is the only instance that is using
the node directory, that directory is also removed.

If a standalone instance is deleted, the instance's standalone
configuration is also deleted. A standalone instance refers to a
configuration that is named instance-name`-config` to which no other
clusters or unclustered instances refer.

This subcommand is supported in remote mode only.

[[sthref755]]

=== Options

asadmin-options::
  Options for the `asadmin` utility. For information about these
  options, see the link:asadmin.html#asadmin-1m[`asadmin`(1M)] help page.
`--help`::
`-?`::
  Displays the help text for the subcommand.

[[sthref756]]

=== Operands

instance-name::
  The name of the instance to delete.

[[sthref757]]

=== Examples

[[GSRFM553]][[sthref758]]

==== Example 1   Deleting a {productName} Instance

This example deletes the {productName} instance `pmdsainst`.

[source]
----
asadmin> delete-instance pmdsainst

Command delete-instance executed successfully.
----

[[sthref759]]

=== Exit Status

0::
  command executed successfully
1::
  error in executing the command

[[sthref760]]

=== See Also

link:asadmin.html#asadmin-1m[`asadmin`(1M)]

link:create-instance.html#create-instance-1[`create-instance`(1)],
link:create-local-instance.html#create-local-instance-1[`create-local-instance`(1)],
link:delete-local-instance.html#delete-local-instance-1[`delete-local-instance`(1)],
link:setup-ssh.html#setup-ssh-1[`setup-ssh`(1)],
link:start-instance.html#start-instance-1[`start-instance`(1)],
link:start-local-instance.html#start-local-instance-1[`start-local-instance`(1)],
link:stop-instance.html#stop-instance-1[`stop-instance`(1)],
link:stop-local-instance.html#stop-local-instance-1[`stop-local-instance`(1)],
link:validate-dcom.html#validate-dcom-1[`validate-dcom`(1)]


